#include <iostream>

using namespace std;

int main()
{
	cout  << "Какво означава понятието литерал?" << endl;;
	cout << "В информатиката под литерал се разбира константна стойност на променлива, зададена в сорс кода на дадена компютърна програма. \nЗа разлика от променливите, които при изпълнението на програмата могат да придобиват различни стойности, и константите, \nкоито имат постоянна стойност, литералът представлява самата стойност, поради което понякога ги наричат още и константи." << endl;

	cout << "Какво означава понятието лексема?" << endl;;
	cout <<"Лексемата е единица с лексикално значение, която е в основата на набор от думи, които са свързани." << endl;

	cout << "Какво означава понятието команда?"<<endl;
	cout << "Терминът команда се използва масово в езиците за програмиране и означава инструкция, посредством която се решава конкретен проблем." << endl;

	return 0;
}